public/cs.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-07-04 Sat 15:46 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>CS</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jack Liu">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" href="/css/animate.min.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">CS</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org325a06e">离散数学</a></li>
<li><a href="#orgae87ba0">软件工程</a></li>
<li><a href="#org25c54f2">计算机组成与系统结构</a>
<ul>
<li><a href="#org55baf7d">计算机组成原理</a></li>
<li><a href="#orgbcf7c3d">计算机系统结构</a></li>
</ul>
</li>
<li><a href="#org35a484e">操作系统</a></li>
<li><a href="#orged500ac">程序语言</a>
<ul>
<li><a href="#org260f855">计算机程序设计基础（Python）</a></li>
<li><a href="#org8734d1f">计算机程序设计基础（C）</a></li>
<li><a href="#org3ede839">汇编语言程序设计</a></li>
<li><a href="#org397ea0d">面向对象程序设计基础（C++）</a></li>
<li><a href="#org1dfa43e">基于 Linux 的 C++</a></li>
<li><a href="#orgeaf4a43">C++ 程序设计实践</a></li>
<li><a href="#org5616100">Java 语言程序设计</a></li>
</ul>
</li>
<li><a href="#orgfb0bdf5">编译原理</a></li>
<li><a href="#orgfea57b6">数据结构与算法分析</a></li>
<li><a href="#org7d56fdf">数据库</a>
<ul>
<li><a href="#org3d009a0">数据库系统概论</a></li>
<li><a href="#orgaccd4f2">数据库技术及应用</a></li>
</ul>
</li>
<li><a href="#org24a3fb0">网络</a>
<ul>
<li><a href="#org3c16278">计算机网络</a></li>
<li><a href="#orgf7b8004">计算机网络原理</a></li>
</ul>
</li>
<li><a href="#orge1a061c">其他</a></li>
</ul>
</div>
</div>
<p>
计算机相关课程介绍。
</p>

<div id="outline-container-org325a06e" class="outline-2">
<h2 id="org325a06e">离散数学</h2>
<div class="outline-text-2" id="text-org325a06e">
<p>
i.e. Discrete Mathematics
</p>

<p>
本课程系统介绍 <span class="underline">数理逻辑</span> 以及 <span class="underline">集合论</span> 的基础知识，包括命题逻辑和谓词逻辑、定理的推理演算和机器证明方法，集合和二元关系的基本运算和性质、任意集合中和函数及其性质，无穷集合的基数，以及上述知识在计算机科学中的应用。还介绍 <span class="underline">图</span> 的基本概念，欧拉回路，哈密顿回路，最短路，树，平面图与图和着色，匹配与网络流，图的连通性，群、环、域、布尔代数。
</p>
</div>
</div>

<div id="outline-container-orgae87ba0" class="outline-2">
<h2 id="orgae87ba0">软件工程</h2>
<div class="outline-text-2" id="text-orgae87ba0">
<p>
i.e. Software Engineering
</p>

<p>
本课程以 <span class="underline">软件生命周期</span> 的主要活动为主线，从软件及软件工程的历史和发展、软件开发过程、需求分析、软件设计、程序编码、软件测试、软件维护、软件项目管理、标准及规范等方面全面介绍软件工程的基本理论、方法、技术和工具。
</p>
</div>
</div>

<div id="outline-container-org25c54f2" class="outline-2">
<h2 id="org25c54f2">计算机组成与系统结构</h2>
<div class="outline-text-2" id="text-org25c54f2">
<p>
i.e. Computer Organization and Architecture
</p>

<p>
本课程简单介绍数字电路与计算机中的某些部件的逻辑线路设计，课程主体知识是讲解简单、完整的计算机组成原理和内部运行机制，包括数据表示和运算器部件、指令系统和控制器部件、层次存储器系统、输入输出系统（总线、接口）和输入输出设备等。
</p>
</div>

<div id="outline-container-org55baf7d" class="outline-3">
<h3 id="org55baf7d">计算机组成原理</h3>
<div class="outline-text-3" id="text-org55baf7d">
<p>
i.e. Computer Organization
</p>

<p>
本课程主要介绍简单、完整、单处理器计算机的基本组成原理和几个内部运行机制，并探索硬、软件之间相互作用的关系，以及如何有效利用硬件提高系统性能。内容包括算术逻辑部件（ALU）、指令系统、控制器设计、高速缓冲存储器和虚拟存储器、总线和外部设备等，尽力体现设计计算机时在成本、性能和复杂性之间的权衡。
</p>
</div>
</div>

<div id="outline-container-orgbcf7c3d" class="outline-3">
<h3 id="orgbcf7c3d">计算机系统结构</h3>
<div class="outline-text-3" id="text-orgbcf7c3d">
<p>
i.e. Computer Architecture
</p>

<p>
计算机系统结构是以计算机系统的外部为主来讲解计算机系统基本结构的一门学科。所谓外部特性是指编写出能够在计算机系统上正确运行的程序所必须了解的计算机系统的特性。
</p>

<p>
计算机系统结构研究的主要内容包括：数据表示、寻址方式、指令系统、存储系统、输入输出系统、流水线处理机、超标量处理机、互连网络、向量处理机、并行处理机和多处理机等。
</p>
</div>
</div>
</div>

<div id="outline-container-org35a484e" class="outline-2">
<h2 id="org35a484e">操作系统</h2>
<div class="outline-text-2" id="text-org35a484e">
<p>
i.e. Modern Operating Systems
</p>

<p>
本课程主要讲述现代计算机操作系统的基础知识，分析现代主流操作系统的基本原理与实现技术。旨在掌握操作系统的基本原理，解决系统问题。主要内容包括当代操作系统的基本概念、演化与机制，进程与线程管理， CPU 调度，内存管理，输入输出，文件系统，设备驱动程序，网络技术等。
</p>
</div>
</div>

<div id="outline-container-orged500ac" class="outline-2">
<h2 id="orged500ac">程序语言</h2>
<div class="outline-text-2" id="text-orged500ac">
</div>
<div id="outline-container-org260f855" class="outline-3">
<h3 id="org260f855">计算机程序设计基础（Python）</h3>
<div class="outline-text-3" id="text-org260f855">
<p>
i.e. The Fundamentals of Computer Programming (Python)
</p>

<p>
本课程以 Python 语言程序设计和内容为基础，注重讲解程序设计的概念、方法和思路。旨在掌握基本的编程技术，提高逻辑思维能力、系统思维能力和抽象思维能力。主要内容包括：程序设计的基本概念、 Python 语言基础与 Python 程序结构、数学与数值计算、字符串与文件操作、列表与数据操作、函数与递归函数、分支结构与循环结构、程序设计方法学、面向过程程序设计与面向对象程序设计、图形编程、算法设计等。
</p>
</div>
</div>

<div id="outline-container-org8734d1f" class="outline-3">
<h3 id="org8734d1f">计算机程序设计基础（C）</h3>
<div class="outline-text-3" id="text-org8734d1f">
<p>
i.e. Programming Fundamentals
</p>

<p>
本课程以 C 语言程序设计内容为基础，注重讲解程序设计的概念、方法和思路，培养基本编程能力，以及逻辑思维和抽象思维能力。主要内容包括 C 语言基础与程序控制结构、结构化程序设计，函数与模块化、库与接口设计、复合数据类型（数组、指针、结构体）、文件、算法设计、递归程序设计、数据抽象、程序抽象等。
</p>
</div>
</div>

<div id="outline-container-org3ede839" class="outline-3">
<h3 id="org3ede839">汇编语言程序设计</h3>
<div class="outline-text-3" id="text-org3ede839">
<p>
i.e. Assembly Language Programming
</p>

<p>
本课程与计算机组成原理、编译原理、操作系统、计算机系统结构等课程组成计算机系统核心课程。你应该掌握了 C 语言，该课程从相对熟悉和语言入手可以加深对汇编和理解与印象。更重要的，汇编语言是高级语言在机器层面的表示，掌握这两种语言和对应可以将程序的执行与计算机的工作过程紧密联系起来，直接体现汇编语言本身固有和特点，即它是最易于将“程序”和“机器”统一起来和一个结合点。进一步的通过对不同汇编代码的解释来给出微体系结构方面的差异，可以为后续课程，如编译原理、计算机组成原理等提供一些先导知识，并利于从整个系统构成的角度来理解各个课程的作用与位置。
</p>

<p>
在内容选择上比从系统角度“自上而下/自下而上”的来组织汇编课程内容，将汇编定位为软硬件的接口、处理器对外提供功能规格。具体的，从 C 语言角度、处理器结构角度讲解汇编语言的语义及其某些新的汇编指令出现的原因，并突出汇编优化程序的特点以及“反汇编”的应用，并引入了 MIPS 汇编的内容来为同一课组的后续课程打下基础。
</p>

<p>
总的内容包括以下几个方面：
</p>

<pre class="example">
1. 基础知识
- 汇编语言与计算机系统结构
- 各类指令集初步
- 数制与整数表示
- 浮点数表示

2. X86 汇编
- 80x86 计算机组织与保护模式
- X86 指令系统与寻址方式
- C 与 X86 汇编
- X86 汇编语言程序格式与基本编程

3. MIPS 汇编
- MIPS 计算机组织初步
- 指令系统介绍
- 汇编代码与异常处理
</pre>
</div>
</div>

<div id="outline-container-org397ea0d" class="outline-3">
<h3 id="org397ea0d">面向对象程序设计基础（C++）</h3>
<div class="outline-text-3" id="text-org397ea0d">
<p>
i.e. Foundation of Object-Oriented Programming
</p>

<p>
本课程以 C++ 语言为基础，详细介绍用 C++ 进行面向对象的程序设计的核心思想。 C++ 语言设计成熟、理论体系完整，全面支持面向对象设计思想，应用十分广泛。以 C++ 进行面向对象程序设计，可以保证程序的调试可复用性、可维护性，有利于团队协作，便于复杂系统的设计与实现。
</p>

<p>
通过学习，本课程要求全面掌握用 C++ 语言进行面向对象程序设计的基本概念和方法，建立面向对象的思维模式，并能训练用 C++ 实现这些思路。具体内容包括： C++ 面向对象的基本语法、面向对象的编程方法和思想，以及设计模式等内容。要求理解对象、继承、多态、模板等技术手段。
</p>
</div>
</div>

<div id="outline-container-org1dfa43e" class="outline-3">
<h3 id="org1dfa43e">基于 Linux 的 C++</h3>
<div class="outline-text-3" id="text-org1dfa43e">
<p>
i.e. C++ Programming for Linux
</p>

<p>
本课程为计算机课程，以 Linux 操作系统下的 C++ 语言程序设计为基础，注重讲解程序设计的概念、方法和思路，，培养基本编程能力，以及逻辑思维和抽象思维能力。主要内容包括 C++ 基本概念， C++ 语法规范，结构化程序设计，函数与模块化、库与接口设计、复合数据类型（数组、指针、结构体）、文件、算法设计、递归程序设计、数据抽象、程序抽象、面向对象程序设计、 Linux 系统编程（进程编程、线程编程和网络编程）等。
</p>
</div>
</div>

<div id="outline-container-orgeaf4a43" class="outline-3">
<h3 id="orgeaf4a43">C++ 程序设计实践</h3>
<div class="outline-text-3" id="text-orgeaf4a43">
<p>
i.e. The Practice of C++ Programming
</p>

<p>
本课程预期掌握的关键知识点包括：类与对象、封装、继承、多态、模板、命名空间与类库、异常处理、以及 Qt 程序设计初步。
</p>
</div>
</div>

<div id="outline-container-org5616100" class="outline-3">
<h3 id="org5616100">Java 语言程序设计</h3>
<div class="outline-text-3" id="text-org5616100">
<p>
i.e. Java and Object-Oriented Programming
</p>

<p>
本课程介绍 Java 语言程序设计基础知识，包括 Java 的基础语法、面向对象和程序设计方法、 GUI 程序和多线程程序开发方法简介、数据库访问及网络程序设计方法简介。
</p>
</div>
</div>
</div>
<div id="outline-container-orgfb0bdf5" class="outline-2">
<h2 id="orgfb0bdf5">编译原理</h2>
<div class="outline-text-2" id="text-orgfb0bdf5">
<p>
i.e. Proinciples and Practice of Compiler Construction
</p>

<p>
本课程主要介绍编译程序构造的原理与实践，课程涵盖的内容包括：词法分析，语法分析，语义分析，语法制导翻译，运行时环境，代码生成和优化等。
</p>

<p>
课程实验是一个 4~5 阶段的项目，其内容是基于课程给定框架设计和实现一个完整的小型面向对象语言的编译程序。
</p>
</div>
</div>

<div id="outline-container-orgfea57b6" class="outline-2">
<h2 id="orgfea57b6">数据结构与算法分析</h2>
<div class="outline-text-2" id="text-orgfea57b6">
<p>
i.e. Data Structure and Algorithm Analysis
</p>

<p>
本课程旨在围绕各类数据结构的设计与实现，揭示其中的规律原理与方法技巧；同时针对算法设计及其性能分析，以了解掌握主要的套路与手法。
</p>
</div>
</div>

<div id="outline-container-org7d56fdf" class="outline-2">
<h2 id="org7d56fdf">数据库</h2>
<div class="outline-text-2" id="text-org7d56fdf">
</div>
<div id="outline-container-org3d009a0" class="outline-3">
<h3 id="org3d009a0">数据库系统概论</h3>
<div class="outline-text-3" id="text-org3d009a0">
<p>
i.e. Introduction to Database Management System
</p>

<p>
本课程主要分四大部分：
</p>
<ul class="org-ul">
<li>数据库的设计与应用：主要讲述 E-R 模型和关系模型；</li>
<li>数据库管理系统的数据存储：主要讲文件组织和索引结构；</li>
<li>数据库管理系统的核心技术：主要讲述查询处理、事务管理和并发控制；</li>
<li>数据库管理系统的体系结构扩展和前沿研究。</li>
</ul>
</div>
</div>

<div id="outline-container-orgaccd4f2" class="outline-3">
<h3 id="orgaccd4f2">数据库技术及应用</h3>
<div class="outline-text-3" id="text-orgaccd4f2">
<p>
i.e. Principal and Application of Database
</p>

<p>
本课程内容主要包括：数据库技术基本知识、 SQL 语言、数据处理、数据可视化。
</p>
</div>
</div>
</div>

<div id="outline-container-org24a3fb0" class="outline-2">
<h2 id="org24a3fb0">网络</h2>
<div class="outline-text-2" id="text-org24a3fb0">
</div>
<div id="outline-container-org3c16278" class="outline-3">
<h3 id="org3c16278">计算机网络</h3>
<div class="outline-text-3" id="text-org3c16278">
<p>
i.e. Computer Networks
</p>

<p>
本课程介绍计算机网络的概念、原理和体系结构，着重讲述物理层、数据链路层、介质访问层、网络层、传输层和应用层的基本原理和协议，掌握以 TCP/IP 协议族为主的网络协议结构，初步培养在 LAN 上的实际工作能力，并且了解网络新技术的最新发展。
</p>
</div>
</div>

<div id="outline-container-orgf7b8004" class="outline-3">
<h3 id="orgf7b8004">计算机网络原理</h3>
<div class="outline-text-3" id="text-orgf7b8004">
<p>
i.e. Theory of Computer Network
</p>

<p>
介绍计算机网络的概念、原理和体系结构，着重讲述物理层、数据链路层、介质访问层、网络层、传输层和应用层的基本原理和协议。
</p>
</div>
</div>
</div>

<div id="outline-container-orge1a061c" class="outline-2">
<h2 id="orge1a061c">其他</h2>
<div class="outline-text-2" id="text-orge1a061c">
<p>
其他课程如并行计算、深度学习、机器学习、数据挖掘与分析，大数据、神经网络、人机交互等可按照自己的兴趣和方向进行深入学习。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-07-01 Wed 21:53</p>
<p class="author">Author: Jack Liu</p>
<p class="date">Created: 2020-07-04 Sat 15:46</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
